EDT/УТ/src/DataProcessors/ПолигональныйМаршрутизаторТест/ПолигональныйМаршрутизаторТест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПолигональныйМаршрутизаторТест</name>
  <attributes>
    <name>ПериодАвтообновленияДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УстановкаПолигоновСУчетомКатегорийТранспорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКартыПолигональногоМаршрутизатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьУжеПривязанныеПолигоныВФормеПривязкиПолигонов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыЗаказа/ДополнительныеПараметрыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыЗаказа</name>
  <resources>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтклоненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </resources>
  <resources>
    <name>ЧастичныйВыкупЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОжиданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентомИзмененное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>okey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>nameOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодъемОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасстояниеОтБазыПоДорогам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоСопоставленияКатегории</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДСФЗПоДоставке</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </resources>
  <resources>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъемаЗаказа</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ТарифнаяСеткаПодъемаЗаказов</name>
    <type>
      <types>CatalogRef.ТарифыПодъемаЗаказовНаЭтаж</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП_Миго</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>СхемаЛогистическихБрейков</name>
    <type>
      <types>CatalogRef.СхемыЛогистическихБрейков</types>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийБрейк</name>
    <type>
      <types>CatalogRef.ЛогистическиеБрейки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательЗаказа</name>
    <type>
      <types>CatalogRef.ПолучателиЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПредъявлениеУдостоверяющегоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифРасчетаСтоимостиДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НегабаритныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Агрегатор</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </resources>
  <resources>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПВЗ</name>
    <type>
      <types>CatalogRef.ПунктыПВЗ</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияЗаказа</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаОтслеживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСозданияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ГабаритнаяХарактеристикаОпределенияЛогБрейка</name>
    <type>
      <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПолигоныМаршрутизацииЗаказов/ПолигоныМаршрутизацииЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПолигоныМаршрутизацииЗаказов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПолигонМаршрутизации</name>
    <type>
      <types>CatalogRef.ПолигоныМаршрутизации</types>
    </type>
  </resources>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расчет1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаМаршрутизации</name>
    <type>
      <types>CatalogRef.СхемыПолигональнойМаршрутизации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/DataProcessors/ПолигональныйМаршрутизаторТест/Forms/ФормаПодсказкиПоЗаказу/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
	Товары.Параметры.УстановитьЗначениеПараметра("Заказ", "");
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Контрагенты.Ссылка КАК Контрагент,
	            |	Контрагенты.Родитель.ОсновнойМагазин КАК Агрегатор
	            |ПОМЕСТИТЬ ВТ_Агрегаторы
	            |ИЗ
	            |	Справочник.Контрагенты КАК Контрагенты
	            |ГДЕ
	            |	Контрагенты.Родитель.ОсновнойМагазин <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслугУслуги.Ссылка КАК Заказ,
	            |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма
	            |ПОМЕСТИТЬ ВТ_ИтогоПоУслугам
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	            |ГДЕ
	            |	РеализацияТоваровУслугУслуги.Ссылка.Номер = &НомерЗаказа
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	РеализацияТоваровУслугУслуги.Ссылка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслугТовары.Ссылка КАК Заказ,
	            |	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма
	            |ПОМЕСТИТЬ ВТ_ИтогоПоТоварам
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	            |ГДЕ
	            |	РеализацияТоваровУслугТовары.Ссылка.Номер = &НомерЗаказа
	            |
	            |СГРУППИРОВАТЬ ПО
	            |	РеализацияТоваровУслугТовары.Ссылка
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.Номер КАК НомерЗаказа,
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа КАК НомерЗаказаИМ,
	            |	РеализацияТоваровУслуг.ВладелецТовара КАК Магазин,
	            |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации КАК Полигон,
	            |	ДополнительныеПараметрыЗаказа.ЛогистическийБрейк КАК ЛогистическийБрейк,
	            |	ВТ_ИтогоПоТоварам.Сумма КАК СуммаТоваров,
	            |	ВТ_ИтогоПоУслугам.Сумма КАК СуммаДоставки,
	            |	ВТ_ИтогоПоТоварам.Сумма + ВТ_ИтогоПоУслугам.Сумма КАК Итого,
	            |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	            |	новаМестнаяДоставка.ТочкаПрибытия.Адрес.Наименование КАК Адрес,
	            |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка) КАК ТипЗаказа,
	            |	0 КАК ОбъемЗабора,
	            |	ВТ_Агрегаторы.Агрегатор КАК Агрегатор,
	            |	новаМестнаяДоставка.ВремяПрибытияС КАК ИнтервалВремениС,
	            |	новаМестнаяДоставка.ВремяПрибытияПо КАК ИнтервалВремениПо,
	            |	ВЫБОР
	            |		КОГДА ДополнительныеПараметрыЗаказа.ТарифицируемыйВес = 0
	            |			ТОГДА РеализацияТоваровУслуг.ОбщийВес
	            |		ИНАЧЕ ДополнительныеПараметрыЗаказа.ТарифицируемыйВес
	            |	КОНЕЦ КАК ВесЗаказа,
	            |	РеализацияТоваровУслуг.ОбъёмЗаказа КАК ОбъемЗаказа
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	            |		ПО РеализацияТоваровУслуг.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогоПоТоварам КАК ВТ_ИтогоПоТоварам
	            |		ПО РеализацияТоваровУслуг.Ссылка = ВТ_ИтогоПоТоварам.Заказ.Ссылка
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации.Ссылка = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
	            |		ПО (РеализацияТоваровУслуг.Ссылка = ВЫРАЗИТЬ(ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ КАК Документ.РеализацияТоваровУслуг).Ссылка)
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогоПоУслугам КАК ВТ_ИтогоПоУслугам
	            |		ПО РеализацияТоваровУслуг.Ссылка = ВТ_ИтогоПоУслугам.Заказ.Ссылка
	            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	            |		ПО (ДополнительныеПараметрыЗаказа.Доставка = новаМестнаяДоставка.Ссылка)
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Агрегаторы КАК ВТ_Агрегаторы
	            |		ПО РеализацияТоваровУслуг.ВладелецТовара.Ссылка = ВТ_Агрегаторы.Контрагент.Ссылка
	            |ГДЕ
	            |	РеализацияТоваровУслуг.Номер = &НомерЗаказа
	            |
	            |ОБЪЕДИНИТЬ ВСЕ
	            |
	            |ВЫБРАТЬ
	            |	ЗаборТовара.Номер,
	            |	ЗаборТовара.НомерВнешнегоЗаказа,
	            |	ЗаборТовара.Контрагент,
	            |	ПолигоныМаршрутизацииЗаказовСрезПоследних.ПолигонМаршрутизации,
	            |	"""",
	            |	0,
	            |	0,
	            |	0,
	            |	ЗаборТовара.Ссылка,
	            |	ЗаборТовара.ТочкаДоставки.Адрес.Наименование,
	            |	ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Забор),
	            |	ЗаборТовара.ОбъемЗабора,
	            |	ВТ_Агрегаторы.Агрегатор,
	            |	NULL,
	            |	NULL,
	            |	0,
	            |	0
	            |ИЗ
	            |	Документ.ЗаборТовара КАК ЗаборТовара
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПолигоныМаршрутизацииЗаказов.СрезПоследних(, СхемаМаршрутизации.Ссылка = &СхемаМаршрутизации) КАК ПолигоныМаршрутизацииЗаказовСрезПоследних
	            |		ПО (ЗаборТовара.Ссылка = ВЫРАЗИТЬ(ПолигоныМаршрутизацииЗаказовСрезПоследних.Заказ КАК Документ.ЗаборТовара).Ссылка)
	            |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Агрегаторы КАК ВТ_Агрегаторы
	            |		ПО ЗаборТовара.Контрагент.Ссылка = ВТ_Агрегаторы.Контрагент.Ссылка
	            |ГДЕ
	            |	ЗаборТовара.Номер = &НомерЗаказа";
	
	Зап.УстановитьПараметр("НомерЗаказа", НомерЗаказа);
	Зап.УстановитьПараметр("СхемаМаршрутизации", СхемаМаршрутизации);
	Выб = Зап.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Магазин = Выб.Магазин;
		НомерЗаказа = Выб.НомерЗаказа;
		НомерЗаказаМагазина = Выб.НомерЗаказаИМ;
		Полигон = Выб.Полигон;
		ЛогистическийБрейк = Выб.ЛогистическийБрейк;
		СтоимостьТоваров = Выб.СуммаТоваров;
		СтоимостьДоставки = Выб.СуммаДоставки;
		СтоимостьИтого = Выб.Итого;
		Адрес = Выб.Адрес;
		ТипЗаказа = Выб.ТипЗаказа;
		ОбъемЗабора = Выб.ОбъемЗабора;
		Агрегатор = Выб.Агрегатор;
		ИнтервалВремениС = Выб.ИнтервалВремениС;
		ИнтервалВремениПо = Выб.ИнтервалВремениПо;
		ВесЗаказа = Выб.ВесЗаказа;
		ОбъемЗаказа = Выб.ОбъемЗаказа;
	КонецеСли;	
	ВидимостьГрупп();
	Товары.Параметры.УстановитьЗначениеПараметра("Заказ", Выб.Заказ);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидимостьГрупп()
	Если ТипЗаказа = Перечисления.ТипыЗаказов.Доставка Тогда
		Элементы.ГруппаПараметрыЗабора.Видимость = Ложь;
	ИначеЕсли ТипЗаказа = Перечисления.ТипыЗаказов.Забор Тогда	
		Элементы.ГруппаСтоимость.Видимость = Ложь;
		Элементы.ГруппаПараметрыЗаказа.Видимость = Ложь;
	КонецеСли;	
КонецПроцедуры
